SM_для_EDT/src/Catalogs/vftШаблоныРДО/vftШаблоныРДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>vftШаблоныРДО</name>
  <attributes>
    <name>КодШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетныйВидОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможноАвтоматическоеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельРДО</name>
    <type>
      <types>CatalogRef.впМодельРДО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОчисткаВидаОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортовыйШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтруктураФайла</name>
    <attributes>
      <name>Структура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъединятьСПредыдущей</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьЕслиНеЗаполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеЗаполнятьПослеПараметра</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбязательныеРеквизиты</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоНаНачалоМесяца</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыОпераций</name>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>CatalogRef.vftТиповыеОперации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/Catalogs/vftШаблоныРДО/Forms/ФормаЭлемента/Module.bsl
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СтруктураФайлаСтруктураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыРедактирования = Новый Структура;
	ПараметрыРедактирования.Вставить("Формула", Элемент.ТекстРедактирования);
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ВводТекстаЗавершение",ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.vftРедакторФормул",ПараметрыРедактирования,ЭтаФорма,,,,ОписаниеОповещенияОЗакрытии,);
	
	//УДАЛИТЬ ЕСЛИ ИСПРАВЯТ ОШИБКУ
	//РезультатРедактирования = ОткрытьФормуМодально("ОбщаяФорма.vftРедакторФормул",ПараметрыРедактирования,ЭтаФорма);
	
	//Если РезультатРедактирования = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Если ТекущийЭлемент.ТекущиеДанные.Структура = РезультатРедактирования.Формула Тогда 
	//	Возврат;
	//КонецЕсли;
	//
	//
	//ТекущийЭлемент.ТекущиеДанные.Структура = РезультатРедактирования.Формула;
	//ТекущийЭлемент.ЗакончитьРедактированиеСтроки(Ложь);
	//Модифицированность = Истина;
	//
	//УДАЛИТЬ ЕСЛИ ИСПРАВЯТ ОШИБКУ  rarus markim - исправили
	
КонецПроцедуры

&НаКлиенте
Процедура ВводТекстаЗавершение(РезультатРедактирования, ДополнительныеПараметры) Экспорт
	
	Если РезультатРедактирования = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущийЭлемент.ТекущиеДанные.Структура = РезультатРедактирования.Формула Тогда 
		Возврат;
	КонецЕсли;
	
	ТекущийЭлемент.ТекущиеДанные.Структура = РезультатРедактирования.Формула;
	ТекущийЭлемент.ЗакончитьРедактированиеСтроки(Ложь);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//СписокРеквизитовДокументаРДО;
	РеквизитыРДО = Документы.vftРДО.ПолучитьРеквизитыРДО();
	СписокРеквизитовДокументаРДО.ЗагрузитьЗначения(РеквизитыРДО.ВыгрузитьКолонку("Идентификатор"));
	
	// ++ rarus makole 2021-02-09
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// -- rarus makole 2021-02-09
	
КонецПроцедуры


&НаКлиенте
Процедура ОбязательныеРеквизитыРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбранныйЭлемент = ВыбратьИзСписка(СписокРеквизитовДокументаРДО, Элемент);
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Элементы.ОбязательныеРеквизиты.ТекущиеДанные.Реквизит = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	Элементы.ОбязательныеРеквизиты.ЗакончитьРедактированиеСтроки(Ложь);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда) Экспорт
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды() Экспорт
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
